<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Dropbox Installer.</string>
	<key>Identifier</key>
	<string>com.github.delahaya.download.DropboxInstaller</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Dropbox</string>
		<key>DOWNLOAD_URL</key>
		<string>https://dl-web.dropbox.com/installer?tag_token=AEqGZWovcbGcum2TzNHcaYf2rwoKBN2m3mhwo6G6R7LJfQ&amp;tag=eJyrVipOLS7OzM-Lz0xRslIwNDM0Nzc2MzE3MjE0NTS2MAESppYmRhamJhZGBmbmBiamFhYWtQCb7Q2T%40META&amp;build_no=10.4.26&amp;plat=mac</string>
		<key>NAME</key>
		<string>Dropbox Installer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%APP_FILENAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.getdropbox.DropboxMetaInstaller" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = G7HH3F8CAK</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/%APP_FILENAME%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
